NSCameraUsageDescription = "Belgeleri taramak, fotoğraf ve görüntü çekmek için kamera erişimi izni gereklidir.";
NSFaceIDUsageDescription = "Yüz tanıma ile kimlik doğrulaması için Face ID izni gereklidir.";
NSLocationAlwaysUsageDescription = "Uygulama, bölgeler arasında hareket ettiğinizde dosya yüklemelerinin otomatik olarak tetiklenmesi için konumunuzu kullanır.";
NSPhotoLibraryUsageDescription = "Fotoğraflarınızı ve görüntülerinizi bulutunuza yüklemek için fotoğraf kitaplığına erişim izni gereklidir.";
NSPhotoLibraryAddUsageDescription = "Fotoğraflarınızı ve görüntülerinizi bulutunuza yüklemek için fotoğraf kitaplığına erişim izni gereklidir.";
NSMicrophoneUsageDescription = "Sesli notlar oluşturmak için mikrofona erişme izni gereklidir.";
NSLocationWhenInUseUsageDescription = "Bu uygulama, hareketi algılamak ve dosyaları otomatik olarak yüklemek için konumunuzu kullanır. GPS verilerini kullanmaz ve konumunuzu kaydetmez.";
NSLocationAlwaysAndWhenInUseUsageDescription = "Bu uygulamanın, önemli bir hareket algılandığında dosyaları otomatik olarak yüklemeye başlaması için arka planda bile konumunuza erişebilmesi gerekir. GPS verileri kullanılmaz.";
